Revit 2024 API
LightDistribution Class
 This class is the base class for specifying light distribution.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class LightDistribution : IDisposable
Visual Basic
Public Class LightDistribution _
	Implements IDisposable
Visual C++
public ref class LightDistribution : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.HemisphericalLightDistribution
 Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution
 Autodesk.Revit.DB.Lighting.SphericalLightDistribution
 Autodesk.Revit.DB.Lighting.SpotLightDistribution
See Also
LightDistribution Members
Autodesk.Revit.DB.Lighting Namespace